{
      "lotfi_content": "Ich bin ein leidenschaftlicher Full-Stack-Entwickler mit einer Begeisterung für die Entwicklung robuster und skalierbarer Webanwendungen. Mit einem Jahr praktischer Erfahrung habe ich meine Fähigkeiten in Front-End-Technologien wie ReactJS, JavaScript und Next.js sowie in Back-End-Technologien wie Node.js und MongoDB weiter ausgebaut. Mein Ziel ist es, meine Expertise einzusetzen, um innovative Lösungen zu entwickeln, die das Geschäftswachstum fördern und außergewöhnliche Benutzererlebnisse bieten.",
            "download_cv": "Lebenslauf herunterladen",
      "about_text": "Ich bin ein engagierter und vielseitiger Full-Stack-Entwickler mit einer Leidenschaft für die Entwicklung effizienter und benutzerfreundlicher Webanwendungen. Während meiner einjährigen Weiterbildung konnte ich umfangreiche Erfahrung mit React, Next.js, Node.js, JavaScript, TypeScript und MongoDB sammeln und erfolgreich eine Anwendung entwickeln. Dabei hatte ich die Möglichkeit, an mehreren Projekten zu arbeiten und das Gelernte direkt praktisch umzusetzen. Mein Weg in die Webentwicklung begann mit einer tiefen Neugier darauf, wie Dinge funktionieren, und hat sich zu einem großen Interesse an kontinuierlichem Lernen und Anpassungsfähigkeit entwickelt. Ich freue mich darauf, an verschiedenen Projekten zu arbeiten, um meine technischen Fähigkeiten weiter zu vertiefen und gleichzeitig meine Problemlösungsfähigkeiten und Kommunikationsstärke im Team auszubauen.",
      "experiences": [
        {
          "year": "09/2023 - 11/2024",
          "role": "Full-Stack-Entwickler",
          "company": "DCI Digital Career Institute Berlin",
          "description": "Während meiner Ausbildung habe ich Erfahrung in der Entwicklung und Wartung von Webanwendungen mit Technologien wie JavaScript, React.js und Node.js gesammelt. Ich habe gelernt, dynamische Benutzeroberflächen mit React.js zu entwerfen, die sowohl die Leistung als auch die Benutzererfahrung optimieren. Außerdem habe ich meine JavaScript-Kenntnisse vertieft und RESTful APIs für die Kommunikation zwischen Frontend und Backend implementiert, wobei ich deren Effizienz und Sicherheit gewährleistet habe. Zudem habe ich mit MongoDB gearbeitet, um Datenbanken zu verwalten und robuste Speicherlösungen zu schaffen. Durch mehrere praktische Projekte konnte ich diese Fähigkeiten anwenden, um reale Probleme zu lösen und meine Fähigkeiten in der Projektleitung und der Teamarbeit zu stärken, was mich auf neue Herausforderungen im Bereich der Webentwicklung vorbereitet.",
          "technologies": ["HTML", "CSS", "JavaScript", "ReactJS", "MongoDB"]
        },
        {
          "year": "01/2010 - 04/2023",
          "role": "Projektleiter",
          "company": "Mo-web Research, Düsseldorf",
          "description": "In meiner Rolle als Projektmanager war ich verantwortlich für die Verwaltung und Administration der Unternehmenswebsite. Dies beinhaltete regelmäßige Updates und Verbesserungen, um sicherzustellen, dass die Seite immer aktuell und funktional war. Darüber hinaus war ich für das Handling und die Lösung von Kundenbeschwerden zuständig, um eine hohe Kundenzufriedenheit zu gewährleisten und das Vertrauen in das Unternehmen zu stärken. Ich plante, koordinierte und überwachte zahlreiche Projekte, wobei mein Fokus auf der termingerechten Fertigstellung und der Einhaltung des Budgets lag. Ich arbeitete eng mit verschiedenen Abteilungen zusammen, um sicherzustellen, dass die Projekte reibungslos abliefen und alle Anforderungen erfüllt wurden. Meine Erfahrung in der Projektplanung, Ressourcenverwaltung und Kommunikation half mir, stets effiziente Lösungen zu finden und die Ziele des Unternehmens erfolgreich zu erreichen. "
        },
        {
          "year": "01/2007 - 12/2009",
          "role": "Panel Manager",
          "company": "Mo-web Research, Düsseldorf",
          "description": "Verwaltung und Administration des französischen Nutzerpanels. Bearbeitung und Lösung von Beschwerden von Nutzern, um eine hohe Kundenzufriedenheit sicherzustellen und das Vertrauen in das Unternehmen zu stärken."
        }
      ],
      "project": [
        {
          "title": "Stunden Tracker",
          "image": "project1",
          "description": "Die Freelancer Time Tracker App ermöglicht es Nutzern, ihre Arbeitsstunden mühelos innerhalb festgelegter Zeiträume zu protokollieren und zu speichern. Mit einer benutzerfreundlichen Oberfläche können Freelancer ihre Produktivität einfach verfolgen und so sicherstellen, dass sie organisiert bleiben und sich auf ihre Projekte konzentrieren.",
          "technologies": ["HTML", "CSS", "React", "Node.js", "MongoDB"],
          "gitLink": "https://github.com/lotfi80/zeiterfassung_v5"
        },
        {
          "title": "BeMyEye",
          "image": "project2",
          "description": "Entdecken Sie unschlagbare Angebote und exklusive Rabatte mit der Shop App in Ihrer Stadt! Nutzer können Angebote in ihrer Umgebung posten, und andere Nutzer können diese Angebote nach Region und Kategorie filtern. Darüber hinaus können die Nutzer in Echtzeit Beiträge liken und kommentieren.",
          "technologies": ["HTML", "CSS", "Angular", "Firebase"],
          "gitLink": "https://github.com/lotfi80/BeMyEye-",
          "productionLink": "https://zeiterfassung-v5.onrender.com/"
        },
        {
          "title": "Spiel Canvas *OOP*",
          "image": "project3",
          "description": "Tauche ein in ein aufregendes Abenteuer mit Ball Quest! Navigiere einen dynamischen Ballon durch spannende Level und weiche Hindernissen wie scharfen Dornen und sich bewegenden Wänden aus. Ziele auf die Zielvorgaben, um jedes Ziel zu erreichen.",
          "technologies": ["HTML", "CSS", "React", "Bootstrap"],
          "gitLink": "https://github.com/lotfi80/zeiterfassung_v5",
          "productionLink": "https://lotfi80.github.io/Final-project-Game-canvas-OOP/"
        }
      ],
      "contact": {
        "address": "10 Rue du Neuort, 8373 Hobscheid, Luxemburg",
        "phoneNo": "+352 621412227",
        "email": "salioslim@hotmail.de"
      }
    }
    