{
      "lotfi_content": "Je suis un développeur Full-Stack passionné, avec un enthousiasme pour le développement d'applications web robustes et évolutives. Fort d'une année d'expérience pratique, j'ai affiné mes compétences en technologies front-end telles que ReactJS, JavaScript et Next.js, ainsi qu'en technologies back-end comme Node.js et MongoDB. Mon objectif est de mettre mon expertise à profit pour développer des solutions innovantes qui stimulent la croissance des entreprises et offrent des expériences utilisateur exceptionnelles.",
      "download_cv": "Télécharger CV",
      "about_text": "Je suis un développeur full-stack engagé et polyvalent, passionné par la création d’applications web efficaces et conviviales. Lors de ma formation d’un an, j’ai acquis une vaste expérience avec React, Next.js, Node.js, JavaScript, TypeScript et MongoDB, et j’ai réussi à développer une application. J’ai également eu l’opportunité de travailler sur plusieurs projets, où j’ai pu mettre en pratique ce que j'avais appris. Mon parcours dans le développement web a commencé par une profonde curiosité sur le fonctionnement des choses et s’est transformé en un grand intérêt pour l’apprentissage continu et l’adaptabilité. Je suis impatient de travailler sur divers projets pour approfondir mes compétences techniques tout en renforçant mes capacités de résolution de problèmes et de communication en équipe.",
      "experiences": [
        {
          "year": "09/2023 - 11/2024",
          "role": "Développeur Full Stack",
          "company": "DCI Digital Career Institute Berlin",
          "description": "Au cours de ma formation, j'ai acquis de l'expérience dans le développement et la maintenance d'applications web en utilisant des technologies telles que JavaScript, React.js et Node.js. J'ai appris à concevoir des interfaces utilisateur dynamiques avec React.js, en optimisant les performances et l'expérience utilisateur. J'ai également approfondi mes compétences en JavaScript et dans l'implémentation d'API RESTful pour la communication entre le frontend et le backend, en garantissant leur efficacité et sécurité.De plus, j'ai travaillé avec MongoDB pour gérer des bases de données et créer des solutions de stockage robustes. À travers plusieurs projets pratiques, j'ai pu appliquer ces compétences pour résoudre des problèmes réels et renforcer mes capacités en gestion de projets et en travail d'équipe, me préparant ainsi à de nouveaux défis dans le développement web. ",
          "technologies": ["HTML", "CSS", "JavaScript", "ReactJS", "MongoDB"]
        },
        {
          "year": "01/2010 - 04/2023",
          "role": "Chef de projet",
          "company": "Mo-web Research, Düsseldorf",
          "description": "Dans mon rôle de Project manager j'étais responsable de la gestion et de l'administration du site web de l'entreprise. Cela incluait des mises à jour régulières et des améliorations afin de garantir que le site soit toujours à jour et fonctionnel. De plus, j'étais chargé de gérer et de résoudre les plaintes des clients afin de garantir une haute satisfaction client et de renforcer la confiance dans l'entreprise. J'ai planifié, coordonné et supervisé de nombreux projets, en me concentrant sur leur achèvement dans les délais et le respect du budget. J'ai travaillé en étroite collaboration avec différents départements pour garantir le bon déroulement des projets et que toutes les exigences soient satisfaites. Mon expérience en planification de projets, gestion des ressources et communication m'a permis de trouver des solutions efficaces et d'atteindre les objectifs de l'entreprise avec succès."
        },
        {
          "year": "01/2007 - 12/2009",
          "role": "Responsable du panel",
          "company": "Mo-web Research, Düsseldorf",
          "description": "Gestion et administration du panel utilisateur français. Gestion et résolution des plaintes des utilisateurs pour assurer une grande satisfaction client et renforcer la confiance dans l'entreprise."
        }
      ],
      "project": [
        {
          "title": "Heures Tracker",
          "image": "project1",
          "description": " L'application Freelancer Time Tracker permet aux utilisateurs d'enregistrer et de stocker facilement leurs heures de travail dans des plages horaires spécifiques. Avec une interface conviviale, les freelances peuvent facilement suivre leur productivité, s'assurant ainsi de rester organisés et concentrés sur leurs projets.",
          "technologies": ["HTML", "CSS", "React", "Node.js", "MongoDB"],
          "gitLink": "https://github.com/lotfi80/zeiterfassung_v5"
        },
        {
          "title": "BeMyEye",
          "image": "project2",
          "description": "Découvrez des offres imbattables et des promotions exclusives avec l'application Shop dans votre ville ! Les utilisateurs peuvent publier des offres dans leur région, et d'autres utilisateurs peuvent filtrer ces offres par région et catégorie. De plus, les utilisateurs peuvent aimer et commenter les publications en temps réel.",
          "technologies": ["HTML", "CSS", "Angular", "Firebase"],
          "gitLink": "https://github.com/lotfi80/BeMyEye-",
          "productionLink": "https://zeiterfassung-v5.onrender.com/"
        },
        {
          "title": "Canvas de jeu *OOP*",
          "image": "project3",
          "description": "Plongez dans une aventure passionnante avec Ball Quest ! Naviguez un ballon dynamique à travers des niveaux palpitants et esquivez des obstacles tels que des épines acérées et des murs mouvants. Visez les cibles pour accomplir chaque objectif.",
          "technologies": ["HTML", "CSS", "React", "Bootstrap"],
          "gitLink": "https://github.com/lotfi80/zeiterfassung_v5",
          "productionLink": "https://lotfi80.github.io/Final-project-Game-canvas-OOP/"
        }
      ],
      "contact": {
        "address": "10 Rue du Neuort, 8373 Hobscheid, Luxembourg",
        "phoneNo": "+352 621412227",
        "email": "salioslim@hotmail.de"
      }
    }
    